ЕАС/src/Documents/ЕАС_ИтоговыеОтчеты/ЕАС_ИтоговыеОтчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЕАС_ИтоговыеОтчеты</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ЕАС_ШаблоныОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РассчитанныеПоказатели</name>
    <attributes>
      <name>ПолеФормы</name>
      <type>
        <types>CatalogRef.ЕАС_ПоляФормШаблонов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>30</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УстановленоВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕАС/src/Documents/ЕАС_ИтоговыеОтчеты/Forms/ФормаРасшифровки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ПолеФормы) Тогда
		ПолеФормы = Параметры.ПолеФормы;
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПолеФормы, "ДатаНачала,ДатаОкончания");
		Период.ДатаНачала    = ДатаНачала;
		Период.ДатаОкончания = ДатаОкончания;
		Для Каждого РасшифровкаСтроки Из Параметры.Расшифровка Цикл
			ЗаполнитьЗначенияСвойств(ЗначенияПоказателей.Добавить(), РасшифровкаСтроки.Значение);
		КонецЦикла;	
	Иначе	
		ТекстСообщения = НСтр("ru = 'Открытие формы без параметров не предусмотрено'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;	
	Элементы.ЗначенияПоказателейЗначение.Формат = "ЧДЦ=" + ПолеФормы.ТочностьЧисла;
	Элементы.ЗначенияПоказателейЗначение.ТекстПодвала = Формат(ЗначенияПоказателей.Итог("Значение"), Элементы.ЗначенияПоказателейЗначение.Формат);
КонецПроцедуры

#КонецОбласти
